Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПереченьПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПереченьАксессуаров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аксессуар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Аксессуары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПереченьЦветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьНалогПродукции (Продукция)
	Возврат Продукция.Налог;	
КонецФункции 

&НаСервере
Функция ПолучитьНалогАксессуаров (Аксессуары)
	Возврат Аксессуары.Налог;	
КонецФункции

&НаСервере
Функция ПолучитьНалогЦветов (Цвета)
	Возврат Цвета.Налог;	
КонецФункции


&НаКлиенте
Процедура ПереченьПродукцииПродукцияПриИзменении(Элемент)
	Стр = Элементы.ПереченьПродукции.ТекущиеДанные;
	Стр.Налог = ПолучитьНалогПродукции (Стр.Продукция);
	Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьПродукцииЦенаБезНДСПриИзменении(Элемент)
	Стр = Элементы.ПереченьПродукции.ТекущиеДанные;
	Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьАксессуаровАксессуарПриИзменении(Элемент)
	Стр = Элементы.ПереченьАксессуаров.ТекущиеДанные;
	Стр.Налог = ПолучитьНалогАксессуаров(Стр.Аксессуар);
	Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьАксессуаровЦенаБезНДСПриИзменении(Элемент)
	 Стр = Элементы.ПереченьАксессуаров.ТекущиеДанные;
	 Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
 КонецПроцедуры

&НаКлиенте
 Процедура ПереченьЦветовЦветПриИзменении(Элемент)
	 Стр = Элементы.ПереченьЦветов.ТекущиеДанные;
	 Стр.Налог = ПолучитьНалогЦветов (Стр.Цвет);
	 Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
 КонецПроцедуры

&НаКлиенте
 Процедура ПереченьЦветовЦенаБезНДСПриИзменении(Элемент)
	 Стр = Элементы.ПереченьЦветов.ТекущиеДанные;
	 Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
 КонецПроцедуры
